Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.inspector.plan.networkStatus.none
source: Not planned
ar: غير مخطط
de: Nicht geplant
es: No planificado
fr: Non planifié
id: Tidak direncanakan
it: Non pianificato
ja: 未計画
ko: 계획되지 않음
nl: Niet gepland
pl: Niezaplanowane
pt_br: Não planejado
ru: Не запланирован
tr: Planlanmamış
uk: Не заплановано
vi: Không được lên kế hoạch
zh_hans: 未计划联网
zh_hant: 未計畫聯網

# rag.workspace.inspector.plan.originalQuestion
source: Original question
ar: السؤال الأصلي
de: Ursprüngliche Frage
es: Pregunta original
fr: Question d'origine
id: Pertanyaan asli
it: Domanda originale
ja: 元の質問
ko: 원래 질문
nl: Oorspronkelijke vraag
pl: Oryginalne pytanie
pt_br: Pergunta original
ru: Исходный вопрос
tr: Orijinal soru
uk: Оригінальне запитання
vi: Câu hỏi gốc
zh_hans: 原始问题
zh_hant: 原始問題

# rag.workspace.inspector.plan.questionUnderstanding
source: Question understanding
ar: فهم السؤال
de: Fragenverständnis
es: Comprensión de la pregunta
fr: Compréhension de la question
id: Pemahaman pertanyaan
it: Comprensione della domanda
ja: 質問の理解
ko: 질문 이해
nl: Vraagbegrip
pl: Zrozumienie pytania
pt_br: Compreensão da pergunta
ru: Понимание вопроса
tr: Soru anlama
uk: Розуміння запитання
vi: Hiểu câu hỏi
zh_hans: 问题理解
zh_hant: 問題理解

# rag.workspace.inspector.plan.repoContext
source: Project code
ar: كود المشروع
de: Projektcode
es: Código del proyecto
fr: Code projet
id: Kode proyek
it: Codice del progetto
ja: プロジェクトコード
ko: 프로젝트 코드
pl: Kod projektu
pt_br: Código do projeto
ru: Код проекта
tr: Proje kodu
uk: Код проєкту
vi: Mã dự án
zh_hans: 项目代码
zh_hant: 專案程式碼

# rag.workspace.inspector.plan.repoContext.budget
source: Token budget
ar: ميزانية الرموز
es: Presupuesto de tokens
fr: Budget de jetons
id: Anggaran token
it: Budget di token
ja: トークン予算
ko: 토큰 예산
pl: Budżet tokenów
pt_br: Orçamento de tokens
ru: Токен-бюджет
tr: Token bütçesi
uk: Бюджет токенів
vi: Ngân sách token
zh_hans: Token 预算
zh_hant: Token 預算

# rag.workspace.inspector.plan.repoContext.enabled
source: Deep thinking
ar: التفكير العميق
es: Pensamiento profundo
fr: Réflexion approfondie
ja: 深い思考
ko: 딥 씽킹
nl: Diep denken
pl: Głębokie myślenie
pt_br: Pensamento profundo
ru: Глубокое мышление
tr: Derin düşünme
uk: Глибоке мислення
zh_hans: 深度思考
zh_hant: 深度思考

# rag.workspace.inspector.plan.repoContext.project
source: Project
ar: المشروع
de: Projekt
es: Proyecto
fr: Projet
id: Proyek
it: Progetto
ja: プロジェクト
ko: 프로젝트
pl: Projekt
pt_br: Projeto
ru: Проект
tr: Proje
uk: Проєкт
vi: Dự án
zh_hans: 项目
zh_hant: 專案

# rag.workspace.inspector.plan.repoContext.status
source: Status
ar: الحالة
es: Estado
fr: Statut
it: Stato
ja: ステータス
ko: 상태
ru: Статус
tr: Durum
uk: Статус
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

# rag.workspace.inspector.plan.retrieval.branch.failedFormat
source: Failed · %@
ar: فشل · %@
de: Fehlgeschlagen · %@
es: Falló · %@
fr: Échec · %@
id: Gagal · %@
it: Fallito · %@
ja: 失敗 · %@
ko: 실패 · %@
nl: Mislukt · %@
pl: Niepowodzenie · %@
pt_br: Falhou · %@
ru: Не удалось · %@
tr: Başarısız · %@
uk: Не вдалося · %@
vi: Thất bại · %@
zh_hans: 执行失败 · %@
zh_hant: 執行失敗 · %@

# rag.workspace.inspector.plan.retrieval.branch.providerError
source: retrieval provider unavailable
ar: مزود الاسترجاع غير متاح
de: Retrieval-Anbieter nicht verfügbar
es: proveedor de recuperación no disponible
fr: fournisseur de récupération indisponible
id: penyedia pengambilan tidak tersedia
it: provider di recupero non disponibile
ja: 検索プロバイダが利用不可
ko: 검색 제공자를 사용할 수 없음
nl: ophaalprovider niet beschikbaar
pl: dostawca wyszukiwania niedostępny
pt_br: provedor de recuperação indisponível
ru: провайдер поиска недоступен
tr: alma sağlayıcısı kullanılamıyor
uk: постачальник пошуку недоступний
vi: nhà cung cấp truy xuất không khả dụng
zh_hans: 检索服务不可用
zh_hant: 檢索服務不可用

# rag.workspace.inspector.plan.retrieval.branch.skipped
source: Skipped
ar: تم التخطي
de: Übersprungen
es: Omitido
fr: Ignoré
id: Dilewati
it: Saltato
ja: スキップ
ko: 건너뜀
nl: Overgeslagen
pl: Pominięte
pt_br: Ignorado
ru: Пропущено
tr: Atlandı
uk: Пропущено
vi: Đã bỏ qua
zh_hans: 已跳过
zh_hant: 已跳過

# rag.workspace.inspector.plan.retrieval.candidates
source: Candidate repositories
ar: المستودعات المرشحة
de: Kandidaten-Repositorys
es: Repositorios candidatos
fr: Dépôts candidats
id: Repositori kandidat
it: Repository candidati
ja: 候補リポジトリ
ko: 후보 저장소
nl: Kandidaatrepositories
pl: Repozytoria kandydujące
pt_br: Repositórios candidatos
ru: Репозитории-кандидаты
tr: Aday depolar
uk: Репозиторії-кандидати
vi: Kho lưu trữ ứng viên
zh_hans: 候选仓库
zh_hant: 候選倉庫

# rag.workspace.inspector.plan.retrieval.detail.candidates
source: Candidate repositories
ar: المستودعات المرشحة
de: Kandidaten-Repositorys
es: Repositorios candidatos
fr: Dépôts candidats
id: Repositori kandidat
it: Repository candidati
ja: 候補リポジトリ
ko: 후보 저장소
nl: Kandidaatrepositories
pl: Repozytoria kandydujące
pt_br: Repositórios candidatos
ru: Репозитории-кандидаты
tr: Aday depolar
uk: Репозиторії-кандидати
vi: Kho lưu trữ ứng viên
zh_hans: 候选仓库
zh_hant: 候選倉庫

# rag.workspace.inspector.plan.retrieval.detail.disposition.belowEvidenceScore
source: Below evidence-score threshold
ar: أقل من عتبة درجة الأدلة
de: Unterhalb der Beweisscore-Schwelle
es: Por debajo del umbral de puntuación de evidencia
fr: En dessous du seuil de score de preuve
id: Di bawah ambang skor bukti
it: Sotto la soglia del punteggio di evidenza
ja: エビデンススコアのしきい値を下回る
ko: 증거 점수 임계값 미만
nl: Onder bewijsscoredrempel
pl: Poniżej progu oceny dowodów
pt_br: Abaixo do limite de pontuação de evidência
ru: Ниже порога оценки свидетельств
tr: Kanıt puanı eşiğinin altında
uk: Нижче порогу оцінки доказів
vi: Dưới ngưỡng điểm bằng chứng
zh_hans: 低于证据分阈值
zh_hant: 低於證據分閾值

# rag.workspace.inspector.plan.retrieval.detail.disposition.belowVectorSimilarity
source: Below similarity threshold
ar: أقل من عتبة التشابه
de: Unterhalb der Ähnlichkeitsschwelle
es: Por debajo del umbral de similitud
fr: En dessous du seuil de similarité
id: Di bawah ambang kemiripan vektor
it: Sotto la soglia di similarità
ja: 類似度のしきい値を下回る
ko: 유사도 임계값 미만
nl: Onder gelijkenisdrempel
pl: Poniżej progu podobieństwa
pt_br: Abaixo do limite de similaridade
ru: Ниже порога векторной схожести
tr: Benzerlik eşiğinin altında
uk: Нижче порогу векторної подібності
vi: Dưới ngưỡng tương tự vector
zh_hans: 低于相似度阈值
zh_hant: 低於相似度閾值

# rag.workspace.inspector.plan.retrieval.detail.disposition.evidenceTokenLimit
source: Final evidence token budget
ar: ميزانية رموز الأدلة النهائية
de: Endgültiges Beweis-Token-Budget
es: Presupuesto de tokens de evidencia final
fr: Budget de jetons des preuves finales
id: Anggaran token bukti akhir
it: Budget di token per le evidenze finali
ja: 最終エビデンストークン予算
ko: 최종 증거 토큰 예산
nl: Definitief bewijs tokenbudget
pl: Budżet tokenów dowodów końcowych
pt_br: Orçamento de tokens de evidência final
ru: Бюджет токенов финальных свидетельств
tr: Nihai kanıt token bütçesi
uk: Бюджет токенів остаточних доказів
vi: Ngân sách token bằng chứng cuối cùng
zh_hans: 超过最终证据 Token 预算
zh_hant: 超過最終證據 Token 預算

source: Parent context token limit
ar: حد رموز السياق الأصلي
de: Token-Limit des übergeordneten Kontexts
es: Límite de tokens del contexto padre
fr: Limite de jetons du contexte parent
id: Batas token konteks induk
it: Limite di token del contesto genitore
ja: 親コンテキストトークン制限
ko: 상위 컨텍스트 토큰 제한
nl: Bovenliggende context tokenlimiet
pl: Limit tokenów kontekstu nadrzędnego
pt_br: Limite de tokens de contexto pai
ru: Лимит токенов родительского контекста
tr: Üst bağlam token sınırı
uk: Ліміт токенів батьківського контексту
vi: Giới hạn token ngữ cảnh cha
zh_hans: 超过父段落 Token 上限
zh_hant: 超過父段落 Token 上限

# rag.workspace.inspector.plan.retrieval.detail.disposition.perRepositoryLimit
source: Per-repository limit
ar: الحد لكل مستودع
de: Limit pro Repository
es: Límite por repositorio
fr: Limite par dépôt
id: Batas per repositori
it: Limite per repository
ja: リポジトリごとの制限
ko: 저장소별 제한
nl: Per-repository limiet
pl: Limit na repozytorium
pt_br: Limite por repositório
ru: Лимит на репозиторий
tr: Depo başına sınır
uk: Ліміт на репозиторій
vi: Giới hạn mỗi kho lưu trữ
zh_hans: 超过单仓库上限
zh_hant: 超過單倉庫上限

# rag.workspace.inspector.plan.retrieval.detail.disposition.retained
source: Retained
ar: محتفظ به
de: Beibehalten
es: Retenido
fr: Conservé
id: Dipertahankan
it: Mantenuto
ja: 保持
ko: 유지됨
nl: Behouden
pl: Zachowane
pt_br: Retido
ru: Сохранено
tr: Korundu
uk: Збережено
vi: Đã giữ lại
zh_hans: 已保留
zh_hant: 已保留

# rag.workspace.inspector.plan.retrieval.detail.disposition.sourceDisabled
source: Source disabled
ar: المصدر معطل
de: Quelle deaktiviert
es: Fuente deshabilitada
fr: Source désactivée
id: Sumber dinonaktifkan
it: Sorgente disabilitata
ja: ソース無効
ko: 소스 비활성화됨
nl: Bron uitgeschakeld
pl: Źródło wyłączone
pt_br: Fonte desativada
ru: Источник отключён
tr: Kaynak devre dışı
uk: Джерело вимкнено
vi: Nguồn bị tắt
zh_hans: 来源未启用
zh_hant: 來源未啟用

# rag.workspace.inspector.plan.retrieval.detail.disposition.totalLimit
source: Total evidence limit
ar: الحد الإجمالي للأدلة
de: Gesamtbeweislimit
es: Límite total de evidencia
fr: Limite totale des preuves
id: Batas total bukti
it: Limite totale delle evidenze
ja: エビデンス総数制限
ko: 전체 증거 제한
nl: Totale bewijslimiet
pl: Całkowity limit dowodów
pt_br: Limite total de evidência
ru: Общий лимит свидетельств
tr: Toplam kanıt sınırı
uk: Загальний ліміт доказів
vi: Tổng giới hạn bằng chứng
zh_hans: 超过总证据上限
zh_hant: 超過總證據上限

# rag.workspace.inspector.plan.retrieval.detail.finalEvidence
source: Final evidence
ar: الأدلة النهائية
de: Endgültige Beweise
es: Evidencia final
fr: Preuves finales
id: Bukti akhir
it: Evidenze finali
ja: 最終エビデンス
ko: 최종 증거
nl: Definitief bewijs
pl: Dowody końcowe
pt_br: Evidência final
ru: Финальные свидетельства
tr: Nihai kanıt
uk: Остаточні докази
vi: Bằng chứng cuối cùng
zh_hans: 最终证据
zh_hant: 最終證據

# rag.workspace.inspector.plan.retrieval.detail.fusion
source: Hybrid fusion
ar: الدمج الهجين
de: Hybride Fusion
es: Fusión híbrida
fr: Fusion hybride
id: Fusi hibrida
it: Fusione ibrida
ja: ハイブリッド融合
ko: 하이브리드 퓨전
nl: Hybride fusie
pl: Fuzja hybrydowa
pt_br: Fusão híbrida
ru: Гибридное слияние
tr: Hibrit füzyon
uk: Гібридне злиття
vi: Hợp nhất lai
zh_hans: 混合融合
zh_hant: 混合融合

# rag.workspace.inspector.plan.retrieval.detail.help
source: View this retrieval stage
ar: عرض مرحلة الاسترجاع هذه
de: Diese Retrieval-Stufe anzeigen
es: Ver esta etapa de recuperación
fr: Voir cette étape de récupération
id: Lihat tahap pengambilan ini
it: Visualizza questa fase di recupero
ja: この検索段階を表示
ko: 이 검색 단계 보기
nl: Bekijk deze ophaalfase
pl: Zobacz ten etap wyszukiwania
pt_br: Ver este estágio de recuperação
ru: Просмотреть этот этап поиска
tr: Bu alma aşamasını görüntüle
uk: Переглянути цей етап пошуку
vi: Xem giai đoạn truy xuất này
zh_hans: 查看该检索阶段详情
zh_hant: 查看該檢索階段詳情

# rag.workspace.inspector.plan.retrieval.detail.hitKind.hybrid
source: Hybrid
ar: هجين
es: Híbrido
fr: Hybride
id: Hibrida
it: Ibrido
ja: ハイブリッド
ko: 하이브리드
nl: Hybride
pl: Hybrydowe
pt_br: Híbrido
ru: Гибридный
tr: Hibrit
uk: Гібридний
vi: Lai
zh_hans: 混合命中
zh_hant: 混合命中

# rag.workspace.inspector.plan.retrieval.detail.hitKind.keyword
source: Keyword
ar: كلمة مفتاحية
es: Palabra clave
fr: Mot-clé
id: Kata kunci
ja: キーワード
ko: 키워드
nl: Trefwoord
pl: Słowo kluczowe
pt_br: Palavra-chave
ru: Ключевой
tr: Anahtar kelime
uk: Ключові слова
vi: Từ khóa
zh_hans: 关键词命中
zh_hant: 關鍵詞命中

# rag.workspace.inspector.plan.retrieval.detail.hitKind.repoContext
source: Project code
ar: كود المشروع
de: Projektcode
es: Código del proyecto
fr: Code projet
id: Kode proyek
it: Codice del progetto
ja: プロジェクトコード
ko: 프로젝트 코드
pl: Kod projektu
pt_br: Código do projeto
ru: Код проекта
tr: Proje kodu
uk: Код проєкту
vi: Mã dự án
zh_hans: 项目代码
zh_hant: 專案程式碼

# rag.workspace.inspector.plan.retrieval.detail.hitKind.vector
source: Semantic
ar: دلالي
de: Semantisch
es: Semántico
fr: Sémantique
id: Semantik
it: Semantico
ja: セマンティック
ko: 의미론
nl: Semantisch
pl: Semantyczne
pt_br: Semântico
ru: Семантический
tr: Anlamsal
uk: Семантичний
vi: Ngữ nghĩa
zh_hans: 语义命中
zh_hant: 語意命中

# rag.workspace.inspector.plan.retrieval.detail.keyword
source: Keyword recall
ar: استدعاء الكلمات المفتاحية
es: Recuperación por palabra clave
fr: Rappel par mots-clés
id: Pengambilan kata kunci
it: Richiamo keyword
ja: キーワード検索
ko: 키워드 리콜
nl: Trefwoordterugroep
pl: Przypomnienie słów kluczowych
pt_br: Recuperação por palavra-chave
ru: Ключевой поиск
tr: Anahtar kelime geri çağırma
uk: Пошук за ключовими словами
vi: Truy xuất từ khóa
zh_hans: 关键词召回
zh_hant: 關鍵詞召回

# rag.workspace.inspector.plan.retrieval.detail.rerank
source: Rerank
ar: إعادة الترتيب
es: Reordenamiento
fr: Reclassement
id: Peringkat ulang
ja: 再ランク
ko: 재순위
nl: Herwaardering
pl: Ponowne sortowanie
pt_br: Reclassificação
ru: Переранжирование
tr: Yeniden sıralama
uk: Переранжування
vi: Xếp hạng lại
zh_hans: 重排
zh_hant: 重排

# rag.workspace.inspector.plan.retrieval.detail.rerankScore
source: Rerank score
ar: درجة إعادة الترتيب
es: Puntuación de reordenamiento
fr: Score de reclassement
id: Skor peringkat ulang
it: Punteggio rerank
ja: 再ランクスコア
ko: 재순위 점수
nl: Herwaarderingsscore
pl: Ocena ponownego sortowania
pt_br: Pontuação de reclassificação
ru: Оценка переранжирования
tr: Yeniden sıralama puanı
uk: Оцінка переранжування
vi: Điểm xếp hạng lại
zh_hans: 重排分
zh_hant: 重排分

# rag.workspace.inspector.plan.retrieval.detail.semantic
source: Semantic recall
ar: الاستدعاء الدلالي
de: Semantischer Recall
es: Recuperación semántica
fr: Rappel sémantique
id: Pengambilan semantik
it: Richiamo semantico
ja: セマンティック検索
ko: 의미론 리콜
nl: Semantische terugroep
pl: Przypomnienie semantyczne
pt_br: Recuperação semântica
ru: Семантический поиск
tr: Anlamsal geri çağırma
uk: Семантичний пошук
vi: Truy xuất ngữ nghĩa
zh_hans: 语义召回
zh_hant: 語意召回

# rag.workspace.inspector.plan.retrieval.detail.unavailable
source: Detailed retrieval data is unavailable for this conversation.
ar: بيانات الاسترجاع التفصيلية غير متاحة لهذه المحادثة.
de: Detaillierte Retrieval-Daten sind für diese Konversation nicht verfügbar.
es: Los datos detallados de recuperación no están disponibles para esta conversación.
fr: Les données détaillées de récupération ne sont pas disponibles pour cette conversation.
id: Data pengambilan terperinci tidak tersedia untuk percakapan ini.
it: I dati dettagliati di recupero non sono disponibili per questa conversazione.
ja: この会話では詳細な検索データは利用できません。
ko: 이 대화에 대한 상세 검색 데이터를 사용할 수 없습니다.
nl: Gedetailleerde ophaalgegevens zijn niet beschikbaar voor dit gesprek.
pl: Szczegółowe dane wyszukiwania są niedostępne dla tej rozmowy.
pt_br: Dados detalhados de recuperação não estão disponíveis para esta conversa.
ru: Детальные данные поиска недоступны для этого разговора.
tr: Bu konuşma için ayrıntılı alma verisi mevcut değil.
uk: Детальні дані пошуку недоступні для цієї розмови.
vi: Dữ liệu truy xuất chi tiết không khả dụng cho cuộc trò chuyện này.
zh_hans: 此会话没有保存逐项检索详情。
zh_hant: 此對話未儲存逐項檢索詳情。

# rag.workspace.inspector.plan.retrieval.funnelFormat
source: %1$lld recalled → %2$lld retained
ar: %1$lld تم استدعاؤه ← %2$lld محتفظ به
de: %1$lld abgerufen → %2$lld beibehalten
es: %1$lld recuperados → %2$lld retenidos
fr: %1$lld rappelés → %2$lld conservés
id: %1$lld diingat → %2$lld dipertahankan
it: %1$lld recuperati → %2$lld mantenuti
ja: %1$lld件検索 → %2$lld件保持
ko: %1$lld개 리콜 → %2$lld개 유지
nl: %1$lld opgehaald → %2$lld behouden
pl: %1$lld przywołane → %2$lld zachowane
pt_br: %1$lld recuperados → %2$lld retidos
ru: %1$lld найдено → %2$lld сохранено
tr: %1$lld geri çağrıldı → %2$lld korundu
uk: %1$lld знайдено → %2$lld збережено
vi: %1$lld đã truy xuất → %2$lld đã giữ lại
zh_hans: 召回 %1$lld → 保留 %2$lld
zh_hant: 召回 %1$lld → 保留 %2$lld

# rag.workspace.inspector.plan.retrieval.fusion
source: Hybrid fusion
ar: الدمج الهجين
de: Hybride Fusion
es: Fusión híbrida
fr: Fusion hybride
id: Fusi hibrida
it: Fusione ibrida
ja: ハイブリッド融合
ko: 하이브리드 퓨전
nl: Hybride fusie
pl: Fuzja hybrydowa
pt_br: Fusão híbrida
ru: Гибридное слияние
tr: Hibrit füzyon
uk: Гібридне злиття
vi: Hợp nhất lai
zh_hans: 混合融合
zh_hant: 混合融合

# rag.workspace.inspector.plan.retrieval.fusionFormat
source: %1$lld unique · %2$lld filtered
ar: %1$lld فريد · %2$lld مُصفّى
de: %1$lld einzigartig · %2$lld gefiltert
es: %1$lld únicos · %2$lld filtrados
fr: %1$lld unique · %2$lld filtré
id: %1$lld unik · %2$lld terfilter
it: %1$lld unici · %2$lld filtrati
ja: %1$lld件ユニーク · %2$lld件フィルタリング
ko: %1$lld개 고유 · %2$lld개 필터링됨
nl: %1$lld uniek · %2$lld gefilterd
pl: %1$lld unikalnych · %2$lld przefiltrowanych
pt_br: %1$lld únicos · %2$lld filtrados
ru: %1$lld уникальных · %2$lld отфильтровано
tr: %1$lld benzersiz · %2$lld filtrelenmiş
uk: %1$lld унікальних · %2$lld відфільтровано
vi: %1$lld duy nhất · %2$lld đã lọc
zh_hans: %1$lld 个唯一命中 · 过滤 %2$lld 个
zh_hant: %1$lld 個唯一命中 · 過濾 %2$lld 個

# rag.workspace.inspector.plan.retrieval.guided
source: Local guidance; retrieval not needed
ar: توجيه محلي؛ لا حاجة للاسترجاع
de: Lokale Anleitung; Abruf nicht erforderlich
es: Guía local; no se necesita recuperación
fr: Guidage local ; récupération non nécessaire
id: Panduan lokal; pengambilan tidak diperlukan
it: Guida locale; recupero non necessario
ja: ローカルガイダンス; 検索不要
ko: 로컬 안내; 검색 불필요
nl: Lokale begeleiding; ophalen niet nodig
pl: Lokalne wskazówki; wyszukiwanie niepotrzebne
pt_br: Orientação local; recuperação não necessária
ru: Локальное руководство; поиск не требуется
tr: Yerel yönlendirme; erişim gerekli değil
uk: Локальне керування; пошук не потрібен
vi: Hướng dẫn cục bộ; không cần truy xuất
zh_hans: 本地引导，无需检索
zh_hant: 本地引導，無需檢索

# rag.workspace.inspector.plan.retrieval.keyword
source: Keyword recall
ar: استدعاء بالكلمات المفتاحية
de: Stichwortabruf
es: Recuperación por palabras clave
fr: Rappel par mots-clés
id: Pencarian kata kunci
it: Richiamo per parole chiave
ja: キーワード検索
ko: 키워드 검색
nl: Trefwoordherinnering
pl: Wyszukiwanie słów kluczowych
pt_br: Recuperação por palavra-chave
ru: Поиск по ключевым словам
tr: Anahtar kelime ile geri çağırma
uk: Пошук за ключовими словами
vi: Truy xuất từ khóa
zh_hans: 关键词召回
zh_hant: 關鍵詞召回

# rag.workspace.inspector.plan.retrieval.limits
source: Evidence limits
ar: حدود الأدلة
de: Beweisgrenzen
es: Límites de evidencia
fr: Limites des preuves
id: Batas bukti
it: Limiti delle prove
ja: エビデンス制限
ko: 증거 제한
nl: Bewijslimieten
pl: Limity dowodów
pt_br: Limites de evidência
ru: Ограничения на доказательства
tr: Kanıt sınırları
uk: Обмеження доказів
vi: Giới hạn bằng chứng
zh_hans: 证据上限
zh_hant: 證據上限

# rag.workspace.inspector.plan.retrieval.limitsFormat
source: %1$lld chunks · %2$lld per repository · %3$@ tokens
ar: %1$lld مقطع · %2$lld لكل مستودع · %3$@ رمز
de: %1$lld Blöcke · %2$lld pro Repository · %3$@ Token
es: %1$lld fragmentos · %2$lld por repositorio · %3$@ tokens
fr: %1$lld fragments · %2$lld par dépôt · %3$@ jetons
id: %1$lld potongan · %2$lld per repositori · %3$@ token
it: %1$lld blocchi · %2$lld per repository · %3$@ token
ja: %1$lldチャンク · リポジトリあたり%2$lld · %3$@トークン
ko: %1$lld개 청크 · 저장소당 %2$lld개 · %3$@ 토큰
nl: %1$lld brokken · %2$lld per repository · %3$@ tokens
pl: %1$lld fragmentów · %2$lld na repozytorium · %3$@ tokenów
pt_br: %1$lld trechos · %2$lld por repositório · %3$@ tokens
ru: %1$lld фрагментов · %2$lld на репозиторий · %3$@ токенов
tr: %1$lld parça · depo başına %2$lld · %3$@ token
uk: %1$lld фрагментів · %2$lld на сховище · %3$@ токенів
vi: %1$lld đoạn · %2$lld mỗi kho · %3$@ token
zh_hans: %1$lld 个分片 · 每仓库 %2$lld 个 · %3$@ tokens
zh_hant: %1$lld 個分片 · 每倉庫 %2$lld 個 · %3$@ tokens

# rag.workspace.inspector.plan.retrieval.outcome
source: Outcome
ar: النتيجة
de: Ergebnis
es: Resultado
fr: Résultat
id: Hasil
it: Risultato
ja: 結果
ko: 결과
nl: Resultaat
pl: Wynik
pt_br: Resultado
ru: Результат
tr: Sonuç
uk: Результат
vi: Kết quả
zh_hans: 结果状态
zh_hant: 結果狀態

# rag.workspace.inspector.plan.retrieval.outcome.completed
source: Evidence ready
ar: الأدلة جاهزة
de: Beweise bereit
es: Evidencia lista
fr: Preuves prêtes
id: Bukti siap
it: Prove pronte
ja: エビデンス準備完了
ko: 증거 준비 완료
nl: Bewijs gereed
pl: Dowody gotowe
pt_br: Evidência pronta
ru: Доказательства готовы
tr: Kanıt hazır
uk: Докази готові
vi: Bằng chứng sẵn sàng
zh_hans: 证据已就绪
zh_hant: 證據已就緒

# rag.workspace.inspector.plan.retrieval.outcome.noCandidates
source: No matching repositories
ar: لا توجد مستودعات مطابقة
de: Keine passenden Repositories
es: No hay repositorios coincidentes
fr: Aucun dépôt correspondant
id: Tidak ada repositori yang cocok
it: Nessun repository corrispondente
ja: 一致するリポジトリなし
ko: 일치하는 저장소 없음
nl: Geen overeenkomende repositories
pl: Brak pasujących repozytoriów
pt_br: Nenhum repositório correspondente
ru: Нет подходящих репозиториев
tr: Eşleşen depo yok
uk: Немає відповідних сховищ
vi: Không có kho phù hợp
zh_hans: 没有匹配仓库
zh_hant: 沒有符合的倉庫

# rag.workspace.inspector.plan.retrieval.outcome.noEvidence
source: No relevant evidence
ar: لا توجد أدلة ذات صلة
de: Keine relevanten Beweise
es: Sin evidencia relevante
fr: Aucune preuve pertinente
id: Tidak ada bukti relevan
it: Nessuna prova pertinente
ja: 関連エビデンスなし
ko: 관련 증거 없음
nl: Geen relevant bewijs
pl: Brak istotnych dowodów
pt_br: Nenhuma evidência relevante
ru: Нет релевантных доказательств
tr: İlgili kanıt yok
uk: Немає відповідних доказів
vi: Không có bằng chứng liên quan
zh_hans: 没有相关证据
zh_hant: 沒有相關證據

# rag.workspace.inspector.plan.retrieval.outcome.noReadyChunks
source: No ready chunks
ar: لا توجد مقاطع جاهزة
de: Keine fertigen Blöcke
es: Sin fragmentos listos
fr: Aucun fragment prêt
id: Tidak ada potongan siap
it: Nessun blocco pronto
ja: 準備済みチャンクなし
ko: 준비된 청크 없음
nl: Geen gereed brokken
pl: Brak gotowych fragmentów
pt_br: Nenhum trecho pronto
ru: Нет готовых фрагментов
tr: Hazır parça yok
uk: Немає готових фрагментів
vi: Không có đoạn sẵn sàng
zh_hans: 没有可用分片
zh_hant: 沒有可用分片

# rag.workspace.inspector.plan.retrieval.outcome.skippedStructured
source: Structured query; chunk retrieval skipped
ar: استعلام منظم؛ تم تخطي استرجاع المقاطع
de: Strukturierte Abfrage; Blockabruf übersprungen
es: Consulta estructurada; recuperación de fragmentos omitida
fr: Requête structurée ; récupération de fragments ignorée
id: Kueri terstruktur; pengambilan potongan dilewati
it: Query strutturata; recupero blocchi saltato
ja: 構造化クエリ; チャンク検索をスキップ
ko: 구조화된 쿼리; 청크 검색 생략
nl: Gestructureerde query; brokophalen overgeslagen
pl: Zapytanie strukturalne; pominięto wyszukiwanie fragmentów
pt_br: Consulta estruturada; recuperação de trechos ignorada
ru: Структурированный запрос; поиск фрагментов пропущен
tr: Yapılandırılmış sorgu; parça erişimi atlandı
uk: Структурований запит; пошук фрагментів пропущено
vi: Truy vấn có cấu trúc; bỏ qua truy xuất đoạn
zh_hans: 结构化查询，跳过分片检索
zh_hant: 結構化查詢，跳過片段檢索

# rag.workspace.inspector.plan.retrieval.outcome.sourcesDisabled
source: All sources disabled
ar: جميع المصادر معطلة
de: Alle Quellen deaktiviert
es: Todas las fuentes deshabilitadas
fr: Toutes les sources désactivées
id: Semua sumber dinonaktifkan
it: Tutte le fonti disabilitate
ja: すべてのソースが無効
ko: 모든 소스 비활성화됨
nl: Alle bronnen uitgeschakeld
pl: Wszystkie źródła wyłączone
pt_br: Todas as fontes desativadas
ru: Все источники отключены
tr: Tüm kaynaklar devre dışı
uk: Усі джерела вимкнено
vi: Tất cả nguồn đã tắt
zh_hans: 所有来源均已关闭
zh_hant: 所有來源均已關閉

# rag.workspace.inspector.plan.retrieval.rerank
source: Rerank
ar: إعادة الترتيب
de: Neu bewerten
es: Reordenar
fr: Reclassement
id: Peringkat ulang
it: Riordino
ja: 再ランク
ko: 재순위화
nl: Herordenen
pl: Ponowne sortowanie
pt_br: Reclassificar
ru: Переранжирование
tr: Yeniden sırala
uk: Переранжування
vi: Sắp xếp lại
zh_hans: 重排
zh_hant: 重排
